project/src/DataProcessors/ЗагрузкаСтруктурыФормата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаСтруктурыФормата</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИменаФайловДляЗагрузки</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФормата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФормата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьТолькоНовыеОбъектыСвойстваЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОсновногоПакетаXDTO</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолнаяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаРасширенияФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

project/src/InformationRegisters/ВзаимосвязиВерсийФорматовИРасширений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ВзаимосвязиВерсийФорматовИРасширений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФормата</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВерсияФорматаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФормата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

project/src/Catalogs/ВерсииФормата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ВерсииФормата</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПространствоИмен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/СвойстваФормата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СвойстваФормата</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ОбъектыФормата</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОписаниеТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектХранительСвойств</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбщегоСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбщихРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставнойТип</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НижняяГраница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТипа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фасеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидФасета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФасета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/ТипыФормата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ТипыФормата</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВерсииФормата</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазовыйТип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИмен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВключатьВОписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменБазовогоТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставнойТип</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТипа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фасеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидФасета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФасета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/DataProcessors/ЗагрузкаСтруктурыФормата/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// Выполняет загрузку формата из файлов в объекты информационной базы
// Параметры:
//   ОбщиеПеременные - Структура - общие переменные которые используются при загрузке.
//   АдресВременногоХранилища - Произвольный - Адрес, в который будет  помещен результат загрузки.
Процедура ВыполнитьЗагрузкуФормата(ОбщиеПеременные, АдресВременногоХранилища) Экспорт
	
	ФайлыФабрики = ОбщиеПеременные.ДанныеДляЗагрузки;
	
	мФабрикаXDTO = СоздатьФабрикуXDTO(ФайлыФабрики);
	ОсновнойПакет = Неопределено;
	ВспомогательныйПакет = Неопределено;
	РасширяемыйПакет = Неопределено;
	Если мФабрикаXDTO.Пакеты.Количество() = 1 Тогда
		ОсновнойПакет = мФабрикаXDTO.Пакеты[0];
	Иначе
		Для Каждого ТекПакет Из мФабрикаXDTO.Пакеты Цикл
			Если ВРЕГ(СокрЛП(ТекПакет.URIПространстваИмен)) = ВРЕГ(СокрЛП(ОбщиеПеременные.ИмяОсновногоПакетаXDTO)) Тогда
				ОсновнойПакет = ТекПакет;
			ИначеЕсли ВРЕГ(СокрЛП(ТекПакет.URIПространстваИмен)) = ВРЕГ("http://www.1c.ru/SSL/Exchange/Message") Тогда
				ВспомогательныйПакет = ТекПакет;
			ИначеЕсли ТекПакет.URIПространстваИмен <> "http://www.w3.org/2001/XMLSchema" Тогда
				РасширяемыйПакет = ТекПакет.URIПространстваИмен;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ОсновнойПакет = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Неверно указано имя основного пакета XDTO'"));
		ПоместитьВоВременноеХранилище(Новый Структура("Успех", Ложь), АдресВременногоХранилища);
		Возврат;
	КонецЕсли;
	Если РасширяемыйПакет <> Неопределено Тогда
		// Проверка наличия записей в регистре сведений.
		РасширяемыйПакетСсылка = Справочники.ВерсииФормата.НайтиПоРеквизиту("ПространствоИмен", РасширяемыйПакет); 
		ЕстьЗаписьВРегистреСоответствий = Ложь;
		Если ЗначениеЗаполнено(РасширяемыйПакетСсылка) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Расширение
			|ИЗ РегистрСведений.ВзаимосвязиВерсийФорматовИРасширений
			|ГДЕ ВерсияФорматаОбмена = &РасширяемыйПакет";
			Запрос.УстановитьПараметр("РасширяемыйПакет", РасширяемыйПакетСсылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ЗаписьВРегистреНеликвидна = Ложь; 
				ЕстьЗаписьВРегистреСоответствий = Истина;
				ТекстСообщения = "";
				Если ОбщиеПеременные.СпособЗагрузки = 0 Тогда
					ЗаписьВРегистреНеликвидна = Истина;
					ТекстСообщения = НСтр("ru='Для версии формата %1 назначено расширение формата %2. Загрузить новое расширение %3 невозможно'"); 
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%3", ОбщиеПеременные.НомерВерсииФормата); 
				ИначеЕсли Выборка.Расширение <> ОбщиеПеременные.ВерсияФормата Тогда
					ЗаписьВРегистреНеликвидна = Истина;
					ТекстСообщения = НСтр("ru='Для версии формата %1 назначено другое расширение формата %2. Обновить расширение %3 невозможно'"); 
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%3", ОбщиеПеременные.ВерсияФормата); 
				КонецЕсли;
				Если ЗаписьВРегистреНеликвидна Тогда 
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", РасширяемыйПакетСсылка);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Выборка.Расширение); 
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
					ПоместитьВоВременноеХранилище(Новый Структура("Успех", Ложь), АдресВременногоХранилища);
					Возврат;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	ОбщиеПеременные.Вставить("ЗагрузитьНовыйФормат", Ложь);
	ТекРасширение = ОбщиеПеременные.ЭтоРасширение;
	Если ОбщиеПеременные.СпособЗагрузки = 0 Тогда
		ОбщиеПеременные.ЗагрузитьНовыйФормат = Истина;
		Если НЕ ЗначениеЗаполнено(ОбщиеПеременные.РодительВерсии) Тогда
			НоваяГруппа = Справочники.ВерсииФормата.СоздатьГруппу();
			НоваяГруппа.Наименование = ОбщиеПеременные.ШаблонПространстваИмен;
			НоваяГруппа.ПространствоИмен = ОбщиеПеременные.ШаблонПространстваИмен;
			НоваяГруппа.Расширение = ТекРасширение;
			НоваяГруппа.Записать();
			ОбщиеПеременные.Вставить("РодительВерсии", НоваяГруппа.Ссылка);
		КонецЕсли;
		НовыйФормат = Справочники.ВерсииФормата.СоздатьЭлемент();
		НовыйФормат.Наименование = ОбщиеПеременные.НомерВерсииФормата;
		НовыйФормат.Родитель = ОбщиеПеременные.РодительВерсии;
		НовыйФормат.ПространствоИмен = СокрЛП(ОбщиеПеременные.ИмяОсновногоПакетаXDTO);
		НовыйФормат.Расширение = ТекРасширение;
		НовыйФормат.Записать();
		ОбщиеПеременные.ВерсияФормата = НовыйФормат.Ссылка;
	Иначе
		РеквизитыФормата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбщиеПеременные.ВерсияФормата, "ПространствоИмен, Расширение");
		ИзменятьФормат = ОбщиеПеременные.ВерсияФормата.ПометкаУдаления
					Или РеквизитыФормата.ПространствоИмен
							<> ОбщиеПеременные.ИмяОсновногоПакетаXDTO
					Или РеквизитыФормата.Расширение <> ТекРасширение;
		Если ИзменятьФормат Тогда
			ВерсияФорматаОбъект = ОбщиеПеременные.ВерсияФормата.ПолучитьОбъект();
			ВерсияФорматаОбъект.УстановитьПометкуУдаления(Ложь);
			ВерсияФорматаОбъект.ПространствоИмен = СокрЛП(ОбщиеПеременные.ИмяОсновногоПакетаXDTO);
			ВерсияФорматаОбъект.Расширение = ТекРасширение;
			ВерсияФорматаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(РасширяемыйПакетСсылка) И НЕ ЕстьЗаписьВРегистреСоответствий Тогда
		// При необходимости заполнить регистр взаимосвязей.
		РегистрМенеджерЗаписей = РегистрыСведений.ВзаимосвязиВерсийФорматовИРасширений.СоздатьМенеджерЗаписи();
		РегистрМенеджерЗаписей.Активность = Истина;
		РегистрМенеджерЗаписей.ВерсияФорматаОбмена = РасширяемыйПакетСсылка; 
		РегистрМенеджерЗаписей.Расширение = ОбщиеПеременные.ВерсияФормата;
		РегистрМенеджерЗаписей.Записать(Ложь);
	КонецЕсли;
	ПолучитьОбъектыФормата(ОбщиеПеременные);
	// 0. Обработаем вспомогательный пакет - оттуда нужны только типы.
	Если ВспомогательныйПакет <> Неопределено Тогда
		Для Каждого ЭлементПакета Из ВспомогательныйПакет Цикл
			Если ТипЗнч(ЭлементПакета) = Тип("ТипЗначенияXDTO") Тогда
				ОбработатьЗначениеXDTO(ЭлементПакета,ОбщиеПеременные, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// Проход №1. Создаем список объектов XDTO которые являются табличными частями.
	// А также список объектов XDTO которые являются "хранилищем" общих реквизитов шапки нескольких видов объектов.
	мТабличныеЧасти = Новый ТаблицаЗначений;
	мТабличныеЧасти.Колонки.Добавить("ИмяТЧ");
	мТабличныеЧасти.Колонки.Добавить("ТипТЧ");
	мТабличныеЧасти.Колонки.Добавить("ОбъектТЧ");
	мТабличныеЧасти.Колонки.Добавить("КоличествоСсылок");
	
	мОбщиеРеквизиты = Новый Структура;
	мКлючевыеСвойства = Новый Структура;
	
	мИсключаемыеОбъекты = Новый Массив;
	ОбщиеПеременные.Вставить("СоставныеТипы", Новый Структура);
	
	Для Каждого ЭлементПакета Из ОсновнойПакет Цикл
		Если ТипЗнч(ЭлементПакета) = Тип("ТипОбъектаXDTO") Тогда
			Если ЭлементПакета.Свойства.Количество() = 1
				И ЭлементПакета.Свойства[0].ВерхняяГраница = -1 Тогда
				
				ТипТЧ = ОбработатьТип(ЭлементПакета.Свойства[0].Тип, ОбщиеПеременные).ТипСтрокой;
				НоваяСтрокаТЧ = мТабличныеЧасти.Добавить();
				НоваяСтрокаТЧ.ИмяТЧ = ЭлементПакета.Имя;
				НоваяСтрокаТЧ.ТипТЧ = ТипТЧ;
				НоваяСтрокаТЧ.КоличествоСсылок = 0;
				мИсключаемыеОбъекты.Добавить(ЭлементПакета.Имя);
				мИсключаемыеОбъекты.Добавить(ТипТЧ);
			ИначеЕсли (Найти(ЭлементПакета.Имя, "Строка") = 0 Или Найти(ЭлементПакета.Имя, "Row") = 0) И Найти(ЭлементПакета.Имя, ".") = 0 Тогда
				Если (Найти(ЭлементПакета.Имя, "КлючевыеСвойства") <> 0 Или Найти(ЭлементПакета.Имя, "KeyProperties") <> 0) Тогда
					// Цикл по ключевым свойствам
					ТабКлючевыеСвойства = Новый ТаблицаЗначений;
					ТабКлючевыеСвойства.Колонки.Добавить("Имя");
					ТабКлючевыеСвойства.Колонки.Добавить("Тип");
					ТабКлючевыеСвойства.Колонки.Добавить("НижняяГраница");
					ТабКлючевыеСвойства.Колонки.Добавить("ВозможноПустое");
					ТабКлючевыеСвойства.Колонки.Добавить("ПредопределенныеЗначения");
					ТабКлючевыеСвойства.Колонки.Добавить("ПространствоИмен");
					ТабКлючевыеСвойства.Колонки.Добавить("СоставнойТип"); 
					ТабКлючевыеСвойства.Колонки.Добавить("СоответствиеТипов");
					Для Каждого КлючевоеСвойство Из ЭлементПакета.Свойства Цикл
						НоваяСтрокаОР = ТабКлючевыеСвойства.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаОР, КлючевоеСвойство, "Имя, НижняяГраница, ВозможноПустое"); 
						ПараметрыТипа = ОбработатьТип(КлючевоеСвойство.Тип, ОбщиеПеременные);
						НоваяСтрокаОР.Тип = ПараметрыТипа.ТипСтрокой;
						НоваяСтрокаОР.ПространствоИмен = КлючевоеСвойство.URIПространстваИмен;
						НоваяСтрокаОР.СоставнойТип = ПараметрыТипа.СоставнойТип;
						НоваяСтрокаОР.СоответствиеТипов = ПараметрыТипа.СоответствиеТипов;
						СтруктураПараметровСвойства = Новый Структура("Фасеты, ПредопределенныеЗначения");
						ЗаполнитьФасетыИПредопределенныеЗначения(КлючевоеСвойство, СтруктураПараметровСвойства);
						НоваяСтрокаОР.ПредопределенныеЗначения = СтруктураПараметровСвойства.ПредопределенныеЗначения;
					КонецЦикла;
					
					мКлючевыеСвойства.Вставить(ЭлементПакета.Имя, ТабКлючевыеСвойства);
				ИначеЕсли Найти(ЭлементПакета.Имя, "Составной") <> 0
					Или Найти(ЭлементПакета.Имя, "Composite") <> 0 Тогда
					// Объект-составной тип
					СоответствиеТипов = Новый Соответствие();
					Для Каждого СостТип Из ЭлементПакета.Свойства Цикл
						СоответствиеТипов.Вставить(СостТип.Имя, ОбработатьТип(СостТип.Тип, ОбщиеПеременные).ТипСтрокой);
					КонецЦикла;
					
					ОбщиеПеременные.СоставныеТипы.Вставить(ЭлементПакета.Имя, СоответствиеТипов);
					ОбработатьЗначениеXDTO(ЭлементПакета,ОбщиеПеременные, Истина);
					мИсключаемыеОбъекты.Добавить(ЭлементПакета.Имя);
				Иначе
					// Если свойство одно и его тип не множественный - то это тип
					Если ЭлементПакета.Свойства.Количество() = 1
						И ЭлементПакета.Свойства[0].Тип.Свойства.Количество() < 2 Тогда
						ОбработатьЗначениеXDTO(ЭлементПакета,ОбщиеПеременные, Истина);
					ИначеЕсли ЭлементПакета.Свойства.Количество() > 0 Тогда
						// Цикл по общим реквизитам
						ТабОбщиеРеквизиты = Новый ТаблицаЗначений;
						ТабОбщиеРеквизиты.Колонки.Добавить("Имя");
						ТабОбщиеРеквизиты.Колонки.Добавить("Тип");
						ТабОбщиеРеквизиты.Колонки.Добавить("СоставнойТип");
						ТабОбщиеРеквизиты.Колонки.Добавить("СоответствиеТипов");
						ТабОбщиеРеквизиты.Колонки.Добавить("НижняяГраница");
						ТабОбщиеРеквизиты.Колонки.Добавить("ВозможноПустое");
						ТабОбщиеРеквизиты.Колонки.Добавить("ПредопределенныеЗначения");  
						ТабОбщиеРеквизиты.Колонки.Добавить("ПространствоИмен");
						Для Каждого ОбщийРеквизит Из ЭлементПакета.Свойства Цикл
							НоваяСтрокаОР = ТабОбщиеРеквизиты.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаОР, ОбщийРеквизит, "Имя, НижняяГраница, ВозможноПустое");
							НоваяСтрокаОР.ПространствоИмен = ОбщийРеквизит.URIПространстваИмен;
							ПараметрыТипа = ОбработатьТип(ОбщийРеквизит.Тип, ОбщиеПеременные);
							НоваяСтрокаОР.Тип = ПараметрыТипа.ТипСтрокой;
							НоваяСтрокаОР.СоставнойТип = ПараметрыТипа.СоставнойТип;
							НоваяСтрокаОР.СоответствиеТипов = ПараметрыТипа.СоответствиеТипов;
							СтруктураПараметров = Новый Структура("Фасеты, ПредопределенныеЗначения");
							ЗаполнитьФасетыИПредопределенныеЗначения(ОбщийРеквизит, СтруктураПараметров);
							НоваяСтрокаОР.ПредопределенныеЗначения = СтруктураПараметров.ПредопределенныеЗначения;
						КонецЦикла;
						
						мОбщиеРеквизиты.Вставить(ЭлементПакета.Имя, ТабОбщиеРеквизиты);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ОбщиеПеременные.Вставить("ТабличныеЧасти", мТабличныеЧасти);
	ОбщиеПеременные.Вставить("ИсключаемыеОбъекты", мИсключаемыеОбъекты);
	ОбщиеПеременные.Вставить("ОбщиеРеквизиты", мОбщиеРеквизиты);
	ОбщиеПеременные.Вставить("КлючевыеСвойства", мКлючевыеСвойства);
	// Проход №2 Дополняем таблицу с табличными частями ссылками на объекты XDTO, содержащие реквизиты табличных частей.
	Для Каждого ЭлементПакета Из ОсновнойПакет Цикл
		Если ТипЗнч(ЭлементПакета) = Тип("ТипОбъектаXDTO") Тогда
			СтрокаТЧ = ОбщиеПеременные.ТабличныеЧасти.Найти(ЭлементПакета.Имя, "ТипТЧ");
			Если СтрокаТЧ = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СтрокаТЧ.ОбъектТЧ = ЭлементПакета;
		КонецЕсли;
	КонецЦикла;
	
	// Проход №3. Создаем объекты формата, значения формата и свойства формата.
	Для Каждого ЭлементПакета Из ОсновнойПакет Цикл
		Если ТипЗнч(ЭлементПакета) = Тип("ТипОбъектаXDTO") Тогда
			ОбработатьОбъектXDTO(ЭлементПакета, ОбщиеПеременные);
		ИначеЕсли ТипЗнч(ЭлементПакета) = Тип("ТипЗначенияXDTO") Тогда
			ОбработатьЗначениеXDTO(ЭлементПакета, ОбщиеПеременные);
		КонецЕсли;
	КонецЦикла;
	// Проход №4. Обрабатываем табличные части: если они общие для нескольких объектов, создаем для них общие объекты формата.
	Для Каждого ТЧ Из ОбщиеПеременные.ТабличныеЧасти Цикл
		Если ТЧ.КоличествоСсылок < 2 Тогда
			Продолжить;
		КонецЕсли;
		ТекОбъектФормата = НайтиСоздатьОбъектФормата(СокрЛП(ТЧ.ИмяТЧ), ОбщиеПеременные, Перечисления.ТипыОбщихРеквизитов.ОбщаяТабличнаяЧасть);
		// Заполнение реквизитов ТЧ
		Нпп = 1;
		Для Каждого РеквизитТЧ Из ТЧ.ОбъектТЧ.Свойства Цикл
			// Вычисление типа
			ПараметрыТипа = ОбработатьТип(РеквизитТЧ.Тип, ОбщиеПеременные);
			СтруктураПараметров = ПодготовитьСтруктуруПараметровСвойствФормата(ТекОбъектФормата, РеквизитТЧ, ПараметрыТипа);
			СтруктураПараметров.Порядок = Нпп; 
			СтруктураПараметров.Вставить("ПространствоИмен", РеквизитТЧ.URIПространстваИмен);
			ЗаполнитьФасетыИПредопределенныеЗначения(РеквизитТЧ, СтруктураПараметров);
			ОбработатьСвойствоОбъекта(СтруктураПараметров, ОбщиеПеременные);
			Нпп = Нпп + 1;
		КонецЦикла;
		// Прописывание общей ТЧ в "частных" ТЧ
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ссылка КАК Ссылка
		|ИЗ Справочник.СвойстваФормата
		|ГДЕ ВЫРАЗИТЬ(Тип КАК Строка(1000)) = &Тип И Владелец.Владелец = &ВерсияФормата
		|	И ЭтоГруппа = ИСТИНА И ОбъектХранительСвойств = """"
		|	";
		Запрос.УстановитьПараметр("Тип", СокрЛП(ТЧ.ИмяТЧ));
		Запрос.УстановитьПараметр("ВерсияФормата", ТекОбъектФормата.Владелец);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбъектТЧ = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектТЧ.ОбъектХранительСвойств = СокрЛП(ТЧ.ИмяТЧ);
			ОбъектТЧ.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.ОбщаяТабличнаяЧасть;
			ОбъектТЧ.Записать();
		КонецЦикла;
	КонецЦикла;
	
	Если НЕ (ОбщиеПеременные.ЗагрузитьНовыйФормат
		ИЛИ ОбщиеПеременные.ДобавлятьТолькоНовые) Тогда
		
		Для каждого Объект Из ОбщиеПеременные.ОбъектыФормата Цикл
			
			Если Объект.Ссылка.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;
			
			УдаленныйОбъект = Объект.Ссылка.ПолучитьОбъект();
			УдаленныйОбъект.УстановитьПометкуУдаления(Истина);
			
		КонецЦикла;
		
	КонецЕсли;
	мФабрикаXDTO = Неопределено;
	
	Для Каждого ФайлСхемы Из ФайлыФабрики Цикл
		Попытка
			УдалитьФайлы(ФайлСхемы);
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	ПоместитьВоВременноеХранилище(Новый Структура("Успех, ВерсияФормата", Истина, ОбщиеПеременные.ВерсияФормата), АдресВременногоХранилища);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьОбъектXDTO(ЭлементПакета, ОбщиеПеременные)
	НаименованиеОбъекта = СокрЛП(ЭлементПакета.Имя);
	ТипОбщегоРеквизита = Неопределено;
	Если ОбщиеПеременные.ИсключаемыеОбъекты.Найти(НаименованиеОбъекта) <> Неопределено Тогда
		// Это тип - табличная часть или хранилище общих реквизитов (группа общих свойств).
		// Если это ТЧ - обработаем ее позже. Иначе - создадим группу общих свойств.
		Если ОбщиеПеременные.ТабличныеЧасти.Найти(НаименованиеОбъекта, "ИмяТЧ") <> Неопределено
			ИЛИ Найти(НаименованиеОбъекта, ".") > 0 Тогда
			Возврат;
		КонецЕсли;
		Если ОбщиеПеременные.СоставныеТипы.Свойство(НаименованиеОбъекта) <> Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если (Найти(НаименованиеОбъекта, "КлючевыеСвойства") > 0
		Или Найти(НаименованиеОбъекта, "KeyProperties") > 0) Тогда
		ТипОбщегоРеквизита = Перечисления.ТипыОбщихРеквизитов.КлючевыеСвойства;
	ИначеЕсли Найти(НаименованиеОбъекта, ".") = 0
		И ОбщиеПеременные.ОбщиеРеквизиты.Свойство(НаименованиеОбъекта) <> Неопределено Тогда
		ТипОбщегоРеквизита = Перечисления.ТипыОбщихРеквизитов.ГруппаОбщихСвойств;
	КонецЕсли;
	
	ТекОбъектФормата = НайтиСоздатьОбъектФормата(НаименованиеОбъекта, ОбщиеПеременные, ТипОбщегоРеквизита);
	Нпп = 1;
	Для Каждого СвойствоОбъекта Из ЭлементПакета.Свойства Цикл
		НаименованиеСвойства = СвойствоОбъекта.Имя;
		Если НаименованиеСвойства = "AdditionalInfo" Тогда
			Продолжить;
		КонецЕсли;
		// Вычисление типа
		ПараметрыТипа = ОбработатьТип(СвойствоОбъекта.Тип, ОбщиеПеременные);
		СтруктураПараметров = ПодготовитьСтруктуруПараметровСвойствФормата(ТекОбъектФормата, СвойствоОбъекта, ПараметрыТипа); 
		СтруктураПараметров.Вставить("ПространствоИмен", СвойствоОбъекта.URIПространстваИмен);
		СтруктураПараметров.Порядок = Нпп;
		ЗаполнитьФасетыИПредопределенныеЗначения(СвойствоОбъекта, СтруктураПараметров);
		ОбработатьСвойствоОбъекта(СтруктураПараметров, ОбщиеПеременные);
		Нпп = Нпп + 1;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьЗначениеXDTO(ЭлементПакета, ОбщиеПеременные, ТолькоТипыФормата = Ложь, ТипСтрокой = "")
	ПространствоИмен = ЭлементПакета.URIПространстваИмен;
	// Типы грузим в ТипыФормата
	НаименованиеОбъекта = ЭлементПакета.Имя;
	БазовыйТип = "";
	ПространствоИменБТ = "";
	СоставнойТип = Ложь;
	ТабФасеты = Новый ТаблицаЗначений;
	ТабФасеты.Колонки.Добавить("ВидФасета");
	ТабФасеты.Колонки.Добавить("ЗначениеФасета");
	Если ТипЗнч(ЭлементПакета.БазовыйТип) = Тип("ТипЗначенияXDTO") Тогда
		БазовыйТип = ЭлементПакета.БазовыйТип.Имя;
		ПространствоИменБТ = ЭлементПакета.БазовыйТип.URIПространстваИмен;
		ДополнениеКТипу = ПолучитьДополнениеКТипу(ЭлементПакета, БазовыйТип);
		БазовыйТип = БазовыйТип + ДополнениеКТипу;
		Если ЭлементПакета.Фасеты <> Неопределено Тогда
			Если ЭлементПакета.Фасеты.Количество() > 0 Тогда
				Для Каждого ЭлементФасета Из ЭлементПакета.Фасеты Цикл
					// Перечисления грузятся в значения формата.
					ВидФасетаИмя = "";
					Если ЭлементФасета.Вид = ВидФасетаXDTO.Перечисление Тогда
						Продолжить;
					ИначеЕсли ЭлементФасета.Вид = ВидФасетаXDTO.Длина
						Или ЭлементФасета.Вид = ВидФасетаXDTO.Образец Тогда
						ВидФасетаИмя = СокрЛП(ЭлементФасета.Вид);
					Иначе
						ВидФасетаИмя = ОпределитьИмяФасета(ЭлементФасета.Вид);
					КонецЕсли;
					СтрокаФасет = ТабФасеты.Добавить();
					СтрокаФасет.ВидФасета = ВидФасетаИмя;
					СтрокаФасет.ЗначениеФасета = СокрЛП(ЭлементФасета.Значение);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(БазовыйТип) Тогда
		БазовыйТип = ТипСтрокой;
	КонецЕсли;
	Если Найти(НаименованиеОбъекта, "Составной") <> 0
		Или Найти(НаименованиеОбъекта, "Composite") <> 0 Тогда
		СоставнойТип = Истина;
	КонецЕсли;
	
	ЗапросСсылкиНаТип = Новый Запрос;
	ЗапросСсылкиНаТип.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ Справочник.СвойстваФормата
	|ГДЕ Владелец.Владелец = &ВерсияФормата И ПометкаУдаления = ЛОЖЬ 
	|	И ВЫРАЗИТЬ(Тип КАК Строка(1000)) ПОДОБНО &ИмяТипа_Поиск";
	ЗапросСсылкиНаТип.УстановитьПараметр("ВерсияФормата", ОбщиеПеременные.ВерсияФормата);
	ЗапросСсылкиНаТип.УстановитьПараметр("ИмяТипа_Поиск", "%" + НаименованиеОбъекта + "%");
	РезультатЗапроса = ЗапросСсылкиНаТип.Выполнить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТипыФормата.Ссылка КАК Ссылка,
		|	ТипыФормата.БазовыйТип КАК БазовыйТип,
		|	ТипыФормата.ПространствоИмен КАК ПространствоИмен,
		|	ТипыФормата.ПространствоИменБазовогоТипа КАК ПространствоИменБТ,
		|	ТипыФормата.ПометкаУдаления КАК ПометкаУдаления,
		|	ТипыФормата.СоставнойТип КАК СоставнойТип,
		|	Количество(ТипыФорматаФасеты.ВидФасета) КАК КоличествоФасетов,
		|	Количество(ТипыФорматаСостав.ТипФормата) КАК КоличествоСтрок
		|ИЗ Справочник.ТипыФормата КАК ТипыФормата
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыФормата.Состав КАК ТипыФорматаСостав
		|	ПО ТипыФормата.Ссылка = ТипыФорматаСостав.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыФормата.Фасеты КАК ТипыФорматаФасеты
		|	ПО ТипыФормата.Ссылка = ТипыФорматаФасеты.Ссылка
		|ГДЕ ТипыФормата.Владелец = &ВерсияФормата И ТипыФормата.Наименование = &ИмяТипа
		|	СГРУППИРОВАТЬ ПО ТипыФормата.Ссылка";
	Запрос.УстановитьПараметр("ВерсияФормата", ОбщиеПеременные.ВерсияФормата);
	Запрос.УстановитьПараметр("ИмяТипа", НаименованиеОбъекта);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если НЕ ОбщиеПеременные.ДобавлятьТолькоНовые
			И (Выборка.ПометкаУдаления
			ИЛИ ТабФасеты.Количество() > 0 ИЛИ Выборка.КоличествоФасетов <> ТабФасеты.Количество()
			ИЛИ Выборка.БазовыйТип <> БазовыйТип
			ИЛИ Выборка.ПространствоИменБТ <> ПространствоИменБТ
			ИЛИ Выборка.ПространствоИмен <> ПространствоИмен
			ИЛИ Выборка.СоставнойТип <> СоставнойТип
			ИЛИ СоставнойТип
			ИЛИ (Выборка.КоличествоСтрок = 0 И ЗначениеЗаполнено(БазовыйТип))) Тогда
			ТипФорматаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ТипФорматаОбъект.ПометкаУдаления = Ложь;
			ТипФорматаОбъект.БазовыйТип = БазовыйТип;
			ТипФорматаОбъект.ПространствоИмен = ПространствоИмен;
			ТипФорматаОбъект.ПространствоИменБазовогоТипа = ПространствоИменБТ;
			ТипФорматаОбъект.СоставнойТип = СоставнойТип;
			ЗаполнитьСоставТипа(ТипФорматаОбъект, ЭлементПакета, ОбщиеПеременные);
			ТипФорматаОбъект.Фасеты.Загрузить(ТабФасеты);
			ТипФорматаОбъект.Записать();
		КонецЕсли;
		УдалитьИзОбъектовФормата(Выборка.Ссылка, ОбщиеПеременные);
	Иначе
		ТипФорматаОбъект = Справочники.ТипыФормата.СоздатьЭлемент();
		ТипФорматаОбъект.Владелец = ОбщиеПеременные.ВерсияФормата;
		ТипФорматаОбъект.Наименование = НаименованиеОбъекта;
		ТипФорматаОбъект.БазовыйТип = БазовыйТип;
		ТипФорматаОбъект.ПространствоИмен = ПространствоИмен;
		ТипФорматаОбъект.ПространствоИменБазовогоТипа = ПространствоИменБТ;
		ТипФорматаОбъект.СоставнойТип = СоставнойТип;
		ТипФорматаОбъект.Фасеты.Загрузить(ТабФасеты);
		ЗаполнитьСоставТипа(ТипФорматаОбъект, ЭлементПакета, ОбщиеПеременные);
		ТипФорматаОбъект.Записать();
	КонецЕсли;
	Если ТолькоТипыФормата Тогда
		Возврат;
	КонецЕсли;
	
	// Обрабатываем перечисления - грузим в ЗначенияФормата
	Если ЭлементПакета.Фасеты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЭлементПакета.Фасеты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если ЭлементПакета.Фасеты.Перечисления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеОбъекта = ЭлементПакета.Имя;
	ТекОбъектФормата = НайтиСоздатьОбъектФормата(НаименованиеОбъекта, ОбщиеПеременные);
	Порядок = 0;
	Для Каждого ЭлементПеречисления Из ЭлементПакета.Фасеты Цикл
		Если ЭлементПеречисления.Вид <> ВидФасетаXDTO.Перечисление Тогда
			Продолжить;
		КонецЕсли;
		
		НаименованиеЗначения = СокрЛП(ЭлементПеречисления.Значение);
		Порядок = Порядок + 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаЗначенияФормата();
		Запрос.УстановитьПараметр("ОбъектФормата", ТекОбъектФормата);
		Запрос.УстановитьПараметр("ИмяЗначения", НаименованиеЗначения);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			УдалитьИзОбъектовФормата(Выборка.Ссылка, ОбщиеПеременные);
			Если Выборка.Порядок = Порядок Тогда
				Продолжить;
			КонецЕсли;
			ЗначениеФормата = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			ЗначениеФормата = Справочники.ЗначенияФормата.СоздатьЭлемент();
			ЗначениеФормата.Владелец = ТекОбъектФормата;
			ЗначениеФормата.Наименование = НаименованиеЗначения;
		КонецЕсли;
		ЗначениеФормата.Порядок = Порядок;
		ЗначениеФормата.Записать();
	КонецЦикла;
КонецПроцедуры

Функция ОпределитьИмяФасета(ЭлементФасетаВид)
	Если ЭлементФасетаВид = ВидФасетаXDTO.МаксВключающее Тогда
		Возврат "МаксВключающее";
	ИначеЕсли ЭлементФасетаВид = ВидФасетаXDTO.МаксДлина Тогда
		Возврат "МаксДлина";
	ИначеЕсли ЭлементФасетаВид = ВидФасетаXDTO.МаксИсключающее Тогда
		Возврат "МаксИсключающее";
	ИначеЕсли ЭлементФасетаВид = ВидФасетаXDTO.МинВключающее Тогда
		Возврат "МинВключающее";
	ИначеЕсли ЭлементФасетаВид = ВидФасетаXDTO.МинДлина Тогда
		Возврат "МинДлина";
	ИначеЕсли ЭлементФасетаВид = ВидФасетаXDTO.МинИсключающее Тогда
		Возврат "МинИсключающее";
	ИначеЕсли ЭлементФасетаВид = ВидФасетаXDTO.ПробельныеСимволы Тогда
		Возврат "ПробельныеСимволы";
	ИначеЕсли ЭлементФасетаВид = ВидФасетаXDTO.РазрядовВсего Тогда
		Возврат "РазрядовВсего";
	ИначеЕсли ЭлементФасетаВид = ВидФасетаXDTO.РазрядовДробнойЧасти Тогда
		Возврат "РазрядовДробнойЧасти";
	КонецЕсли;
КонецФункции

Процедура ЗаполнитьСоставТипа(ТипФорматаОбъект, ЭлементПакета, ОбщиеПеременные)
	ТипФорматаОбъект.Состав.Очистить();
	Если ТипФорматаОбъект.СоставнойТип Тогда
		Для Каждого СостТип Из ЭлементПакета.Свойства Цикл
			СтрСостав = ТипФорматаОбъект.Состав.Добавить();
			СтрСостав.ТипФормата = ОбработатьТип(СостТип.Тип, ОбщиеПеременные).ТипСтрокой;
			СтрСостав.ИмяТипа = СостТип.Имя;
		КонецЦикла;
	ИначеЕсли ЗначениеЗаполнено(ТипФорматаОбъект.БазовыйТип) Тогда
		НовСтр = ТипФорматаОбъект.Состав.Добавить();
		НовСтр.ТипФормата = ТипФорматаОбъект.БазовыйТип;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьФасетыИПредопределенныеЗначения(ЭлементПакета, СтруктураПараметров)
	ФасетыСвойства = Неопределено;
	Попытка
		ФасетыСвойства = ЭлементПакета.Тип.Фасеты;
	Исключение
		Возврат;
	КонецПопытки;
	Если ФасетыСвойства = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ФасетыСвойства.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если СтруктураПараметров.Фасеты = Неопределено Тогда
		ТабФасеты = Новый ТаблицаЗначений;
		ТабФасеты.Колонки.Добавить("ВидФасета");
		ТабФасеты.Колонки.Добавить("ЗначениеФасета");
		СтруктураПараметров.Вставить("Фасеты", ТабФасеты);
	КонецЕсли;
	Если СтруктураПараметров.ПредопределенныеЗначения = Неопределено Тогда
		СтруктураПараметров.Вставить("ПредопределенныеЗначения", Новый Массив);
	КонецЕсли;
	Для Каждого ТекФасет Из ФасетыСвойства Цикл
		СтроковоеЗначение = СокрЛП(ТекФасет.Значение);
		Если НЕ ЗначениеЗаполнено(СтроковоеЗначение) Тогда
			Продолжить;
		КонецЕсли;
		Если ТекФасет.Вид = ВидФасетаXDTO.Перечисление Тогда
			СтруктураПараметров.ПредопределенныеЗначения.Добавить(СтроковоеЗначение);
		Иначе
			Если ЭлементПакета.Тип.URIПространстваИмен = "http://www.w3.org/2001/XMLSchema"
				И (ТекФасет.Вид = ВидФасетаXDTO.Образец
				Или (Найти(СокрЛП(ЭлементПакета.Тип),"int") > 0
					И ТекФасет.Вид <> ВидФасетаXDTO.Длина И ТекФасет.Вид <> ВидФасетаXDTO.МаксДлина И ТекФасет.Вид <> ВидФасетаXDTO.МинДлина)) Тогда
				// Такие фасеты не грузим - они не относятся к формату.
				Продолжить;
			КонецЕсли;
			Если ТекФасет.Вид = ВидФасетаXDTO.Длина
				Или ТекФасет.Вид = ВидФасетаXDTO.Образец Тогда
				ВидФасетаИмя = СокрЛП(ТекФасет.Вид);
			Иначе
				ВидФасетаИмя = ОпределитьИмяФасета(ТекФасет.Вид);
			КонецЕсли;

			СтрФасет = СтруктураПараметров.Фасеты.Добавить();
			СтрФасет.ВидФасета = ВидФасетаИмя;
			СтрФасет.ЗначениеФасета = СокрЛП(ТекФасет.Значение);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ПодготовитьСтруктуруПараметровСвойствФормата(ТекОбъектФормата, ТекСвойствоФормата, ПараметрыТипа)
	СтруктураПараметров = Новый Структура("ТекОбъектФормата",ТекОбъектФормата);
	СтруктураПараметров.Вставить("ИмяРеквизита", СокрЛП(ТекСвойствоФормата.Имя));
	
	СтруктураПараметров.Вставить("НижняяГраница", ТекСвойствоФормата.НижняяГраница);
	СтруктураПараметров.Вставить("Обязательное", ТекСвойствоФормата.НижняяГраница > 0);
	
	СтруктураПараметров.Вставить("СоставнойТип", ПараметрыТипа.СоставнойТип);
	СтруктураПараметров.Вставить("ТипРеквизита", ПараметрыТипа.ТипСтрокой);
	СтруктураПараметров.Вставить("СоответствиеТипов", ПараметрыТипа.СоответствиеТипов);
	СтруктураПараметров.Вставить("ОбъектХранительСвойств", "");
	СтруктураПараметров.Вставить("Порядок", 0);
	СтруктураПараметров.Вставить("ЭтоГруппа", Ложь);
	СтруктураПараметров.Вставить("ТипОбщегоСвойства", Перечисления.ТипыОбщихРеквизитов.ПустаяСсылка());
	СтруктураПараметров.Вставить("РодительРеквизита", Справочники.СвойстваФормата.ПустаяСсылка());
	СтруктураПараметров.Вставить("ВложенныеСвойства");
	СтруктураПараметров.Вставить("ПредопределенныеЗначения", Новый Массив);
	
	ТабФасеты = Новый ТаблицаЗначений;
	ТабФасеты.Колонки.Добавить("ВидФасета");
	ТабФасеты.Колонки.Добавить("ЗначениеФасета");
	СтруктураПараметров.Вставить("Фасеты", ТабФасеты);
	Возврат СтруктураПараметров;
КонецФункции

Процедура ДобавитьСвойствоФормата(СтруктураПараметров, ОбщиеПеременные)
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаСвойстваФормата();
	Запрос.УстановитьПараметр("ОбъектФормата", СтруктураПараметров.ТекОбъектФормата);
	Запрос.УстановитьПараметр("ИмяСвойства", СтруктураПараметров.ИмяРеквизита);
	Запрос.УстановитьПараметр("ЭтоГруппа", СтруктураПараметров.ЭтоГруппа);
	Запрос.УстановитьПараметр("Родитель", СтруктураПараметров.РодительРеквизита);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Не ОбщиеПеременные.ДобавлятьТолькоНовые Тогда
			
			УдалитьИзОбъектовФормата(Выборка.Ссылка, ОбщиеПеременные);
			
			Если СокрЛП(Выборка.Тип) <> СтруктураПараметров.ТипРеквизита
				Или Выборка.ПометкаУдаления
				Или Выборка.Обязательное <> СтруктураПараметров.Обязательное
				Или Выборка.Порядок <> СтруктураПараметров.Порядок
				Или Выборка.ОбъектХранительСвойств <> СтруктураПараметров.ОбъектХранительСвойств
				Или Выборка.ТипОбщегоСвойства <> СтруктураПараметров.ТипОбщегоСвойства
				Или Выборка.СоставнойТип <> СтруктураПараметров.СоставнойТип
				Или СтруктураПараметров.НижняяГраница <> Выборка.НижняяГраница
				Или СтруктураПараметров.Фасеты.Количество() > 0
				Или (Не СтруктураПараметров.ЭтоГруппа И СтруктураПараметров.СоответствиеТипов.Количество() > 0) Тогда
				
				СвойствоФормата = Выборка.Ссылка.ПолучитьОбъект();
				СвойствоФормата.ПометкаУдаления = Ложь;
				ЗаполнитьРеквизитыСвойстваФормата(СвойствоФормата, СтруктураПараметров);
				СвойствоФормата.Записать();
			КонецЕсли;
		КонецЕсли;
		
		Если СвойствоФормата = Неопределено Тогда
			СвойствоФормата = Выборка.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		ОбработатьГруппуСвойствФормата(Выборка.Ссылка, СтруктураПараметров, ОбщиеПеременные);
		
	Иначе
		Если СтруктураПараметров.ЭтоГруппа Тогда
			СвойствоФормата = Справочники.СвойстваФормата.СоздатьГруппу();
		Иначе 
			СвойствоФормата = Справочники.СвойстваФормата.СоздатьЭлемент();
		КонецЕсли;
		
		СвойствоФормата.Владелец = СтруктураПараметров.ТекОбъектФормата;
		СвойствоФормата.Наименование = СтруктураПараметров.ИмяРеквизита;
		ЗаполнитьРеквизитыСвойстваФормата(СвойствоФормата, СтруктураПараметров);
		
		СвойствоФормата.Записать();
		
		ОбработатьГруппуСвойствФормата(СвойствоФормата.Ссылка, СтруктураПараметров, ОбщиеПеременные);
		
	КонецЕсли;
	// Возможно, для свойства заданы возможные значения.
	Порядок = 0;
	Для Каждого НаименованиеЗначения Из СтруктураПараметров.ПредопределенныеЗначения Цикл
		Порядок = Порядок + 1;
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаЗначенияФормата();
		Запрос.УстановитьПараметр("ОбъектФормата", СвойствоФормата.Ссылка);
		Запрос.УстановитьПараметр("ИмяЗначения", НаименованиеЗначения);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			УдалитьИзОбъектовФормата(Выборка.Ссылка, ОбщиеПеременные);
			Если Выборка.Порядок = Порядок Тогда
				Продолжить;
			КонецЕсли;
			ЗначениеФормата = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			ЗначениеФормата = Справочники.ЗначенияФормата.СоздатьЭлемент();
			ЗначениеФормата.Владелец = СвойствоФормата.Ссылка;
			ЗначениеФормата.Наименование = НаименованиеЗначения;
		КонецЕсли;
		ЗначениеФормата.Порядок = Порядок;
		ЗначениеФормата.Записать();
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыСвойстваФормата(СвойствоФормата, СтруктураПараметров)
	СвойствоФормата.Тип = Лев(СтруктураПараметров.ТипРеквизита, 1000);
	СвойствоФормата.ОбъектХранительСвойств = СтруктураПараметров.ОбъектХранительСвойств;
	СвойствоФормата.Порядок = СтруктураПараметров.Порядок;
	СвойствоФормата.ТипОбщегоСвойства = СтруктураПараметров.ТипОбщегоСвойства;
	СвойствоФормата.Родитель = СтруктураПараметров.РодительРеквизита;
	СвойствоФормата.Обязательное = СтруктураПараметров.Обязательное;
	СвойствоФормата.НижняяГраница = СтруктураПараметров.НижняяГраница;
	
	Если НЕ СтруктураПараметров.ЭтоГруппа Тогда
		СвойствоФормата.СоставнойТип = СтруктураПараметров.СоставнойТип;
		СвойствоФормата.Состав.Очистить();
		Для Каждого ТекТип Из СтруктураПараметров.СоответствиеТипов Цикл
			НовСтр = СвойствоФормата.Состав.Добавить();
			НовСтр.ИмяТипа = ТекТип.Ключ;
			НовСтр.ТипФормата = ТекТип.Значение;
		КонецЦикла;
		СвойствоФормата.Фасеты.Очистить();
		Для Каждого ТекФасет Из СтруктураПараметров.Фасеты Цикл
			НовСтр = СвойствоФормата.Фасеты.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ТекФасет);
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработатьГруппуСвойствФормата(СвойствоФорматаГруппа, СтруктураПараметров, ОбщиеПеременные)
	Если НЕ СтруктураПараметров.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураПараметров.ВложенныеСвойства) Тогда
		Нпп = 1;
		Для Каждого ОбщийРеквизит Из СтруктураПараметров.ВложенныеСвойства Цикл
			// Ключевые свойства или реквизиты ТЧ относятся к чужому пакету (загрузка расширения).
			СтруктураПараметровТипа = Новый Структура("СоставнойТип,ТипСтрокой", ОбщийРеквизит.СоставнойТип, ОбщийРеквизит.Тип);
			Если ОбщийРеквизит.СоответствиеТипов.Количество() > 0 Тогда
				СоответствиеТипов = ОбщийРеквизит.СоответствиеТипов;
			Иначе
				СоответствиеТипов = Новый Соответствие;
				СоответствиеТипов.Вставить(ОбщийРеквизит.Тип, ОбщийРеквизит.Тип);
			КонецЕсли;
			СтруктураПараметровТипа.Вставить("СоответствиеТипов", СоответствиеТипов);
			СтруктураПараметровСвойствоТЧ = ПодготовитьСтруктуруПараметровСвойствФормата(СтруктураПараметров.ТекОбъектФормата, 
											ОбщийРеквизит, СтруктураПараметровТипа);
			СтруктураПараметровСвойствоТЧ.Вставить("ПространствоИмен", ОбщийРеквизит.ПространствоИмен);
			СтруктураПараметровСвойствоТЧ.РодительРеквизита = СвойствоФорматаГруппа;
			СтруктураПараметровСвойствоТЧ.Порядок = Нпп;
			Если ОбщийРеквизит.ПредопределенныеЗначения <> Неопределено Тогда
				СтруктураПараметровСвойствоТЧ.ПредопределенныеЗначения = ОбщийРеквизит.ПредопределенныеЗначения;
			КонецЕсли;
			ОбработатьСвойствоОбъекта(СтруктураПараметровСвойствоТЧ, ОбщиеПеременные);
			Нпп = Нпп + 1;
		КонецЦикла;
	Иначе
		СтрокаТЧ = ОбщиеПеременные.ТабличныеЧасти.Найти(СтруктураПараметров.ТипРеквизита, "ИмяТЧ");
		Если СтрокаТЧ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		СтрокаТЧ.КоличествоСсылок = СтрокаТЧ.КоличествоСсылок + 1;
		Нпп = 1;
		Для Каждого РеквизитТЧ Из СтрокаТЧ.ОбъектТЧ.Свойства Цикл
			// Вычисление типа
			ПараметрыТипа = ОбработатьТип(РеквизитТЧ.Тип, ОбщиеПеременные);
			СтруктураПараметровСвойствоТЧ = ПодготовитьСтруктуруПараметровСвойствФормата(СтруктураПараметров.ТекОбъектФормата, 
											РеквизитТЧ, ПараметрыТипа);
			СтруктураПараметровСвойствоТЧ.РодительРеквизита = СвойствоФорматаГруппа;
			СтруктураПараметровСвойствоТЧ.Порядок = Нпп;
			СтруктураПараметровСвойствоТЧ.Вставить("ПространствоИмен", РеквизитТЧ.URIПространстваИмен);
			
			ЗаполнитьФасетыИПредопределенныеЗначения(РеквизитТЧ, СтруктураПараметровСвойствоТЧ);
			ОбработатьСвойствоОбъекта(СтруктураПараметровСвойствоТЧ, ОбщиеПеременные);
			Нпп = Нпп + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьСвойствоОбъекта(СтруктураПараметров, ОбщиеПеременные)
	// Возможно, это свойство является табличной частью - поищем его тип среди табличных частей.
	СтрокаТЧ = ОбщиеПеременные.ТабличныеЧасти.Найти(СтруктураПараметров.ТипРеквизита, "ИмяТЧ");
	Если СтрокаТЧ <> Неопределено Тогда
		СтруктураПараметров.ЭтоГруппа = Истина;
		Если СтрокаТЧ.КоличествоСсылок > 1 Тогда
			СтруктураПараметров.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.ОбщаяТабличнаяЧасть;
			СтруктураПараметров.ОбъектХранительСвойств = СтруктураПараметров.ТипРеквизита;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ТипОбщегоСвойства) Тогда
		// Возможно, это ключевое свойство.
		мТаблицаРеквизитов = Неопределено;
		Если (Лев(СтруктураПараметров.ИмяРеквизита, 16) = "КлючевыеСвойства"
			Или Лев(СтруктураПараметров.ИмяРеквизита, 13) = "KeyProperties") Тогда
			ОбщиеПеременные.КлючевыеСвойства.Свойство(СтруктураПараметров.ТипРеквизита, мТаблицаРеквизитов);
		КонецЕсли;
		Если мТаблицаРеквизитов <> Неопределено Тогда
			СтруктураПараметров.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.КлючевыеСвойства;
			СтруктураПараметров.ОбъектХранительСвойств = СтруктураПараметров.ТипРеквизита;
			СтруктураПараметров.ВложенныеСвойства = мТаблицаРеквизитов;
			СтруктураПараметров.ЭтоГруппа = Истина;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ТипОбщегоСвойства) Тогда
		// Возможно, это группа общих свойств.
		мТаблицаРеквизитов = Неопределено;
		Если СокрЛП(СтруктураПараметров.ТипРеквизита) <> "" И Найти(СтруктураПараметров.ТипРеквизита, ".") = 0 
			И Найти(СтруктураПараметров.ТипРеквизита, "(") = 0 
			И Найти(СтруктураПараметров.ТипРеквизита, " ") = 0 
			И Найти(СтруктураПараметров.ТипРеквизита, ",") = 0 
			И СтруктураПараметров.СоставнойТип = Ложь Тогда
			ОбщиеПеременные.ОбщиеРеквизиты.Свойство(СтруктураПараметров.ТипРеквизита, мТаблицаРеквизитов);
		КонецЕсли;
		Если мТаблицаРеквизитов <> Неопределено Тогда
			СтруктураПараметров.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.ГруппаОбщихСвойств;
			СтруктураПараметров.ОбъектХранительСвойств = СтруктураПараметров.ТипРеквизита;
			СтруктураПараметров.ВложенныеСвойства = мТаблицаРеквизитов;
			СтруктураПараметров.ЭтоГруппа = Истина;
		КонецЕсли;
	КонецЕсли;
	ДобавитьСвойствоФормата(СтруктураПараметров, ОбщиеПеременные);
КонецПроцедуры

Функция ОбработатьТип(ТипЗначенияХДТО, ОбщиеПеременные)
	СтруктураРезультат = Новый Структура("ТипСтрокой, СоставнойТип, СоответствиеТипов", "", Ложь, Новый Соответствие);
	Если ТипЗнч(ТипЗначенияХДТО) = Тип("ТипЗначенияXDTO") Тогда
		// Может быть объединение типов
		Если ЗначениеЗаполнено(ТипЗначенияХДТО.ТипыЧленовОбъединения)
			И ТипЗначенияХДТО.ТипыЧленовОбъединения.Количество() > 0 Тогда
			СтруктураРезультат.СоставнойТип = Истина;
			Для Каждого ЕдТип Из ТипЗначенияХДТО.ТипыЧленовОбъединения Цикл
				ИмяЕдТипа = ОбработатьТип(ЕдТип, ОбщиеПеременные).ТипСтрокой;
				Если СокрЛП(ИмяЕдТипа) <> "" Тогда
					СтруктураРезультат.СоответствиеТипов.Вставить(ЕдТип.Имя,ИмяЕдТипа);
				КонецЕсли;
			КонецЦикла;
		Иначе
			ИмяТипа = ТипЗначенияХДТО.Имя;
			Если СокрЛП(ИмяТипа) = "" Тогда
				ИмяТипа = ТипЗначенияХДТО.БазовыйТип.Имя;
			КонецЕсли;
			ДополнениеКТипу = ПолучитьДополнениеКТипу(ТипЗначенияХДТО, ИмяТипа);
			СтруктураРезультат.ТипСтрокой = ИмяТипа + ДополнениеКТипу;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ТипЗначенияХДТО) = Тип("ТипОбъектаXDTO") И СокрЛП(ТипЗначенияХДТО) = "" Тогда
		// Составной тип из нескольких свойств
		СтруктураРезультат.СоставнойТип = Истина;
		Для Каждого СвойствоОбъекта Из ТипЗначенияХДТО.Свойства Цикл
			ТипСвойстваСтрокой = ОбработатьТип(СвойствоОбъекта.Тип, ОбщиеПеременные).ТипСтрокой;
			Если ТипСвойстваСтрокой = "" Тогда
				Продолжить;
			КонецЕсли;
			СтруктураРезультат.СоответствиеТипов.Вставить(СвойствоОбъекта.Имя,ТипСвойстваСтрокой);
		КонецЦикла;
	Иначе
		ПростойТип = СокрЛП(ТипЗначенияХДТО);
		ПозицияРазделителя = Найти(ПростойТип, "}");
		Если ПозицияРазделителя = 0 Тогда
			СтруктураРезультат.ТипСтрокой = ПростойТип;
		Иначе
			СтруктураРезультат.ТипСтрокой = Прав(ПростойТип, СтрДлина(ПростойТип)-ПозицияРазделителя);
		КонецЕсли;
	КонецЕсли;
	СоответствиеТиповСоставногоТипа = Неопределено;
	Если ЗначениеЗаполнено(СтруктураРезультат.ТипСтрокой) Тогда
		Если Найти(СтруктураРезультат.ТипСтрокой, ".") = 0 
			И Найти(СтруктураРезультат.ТипСтрокой, " ") = 0
			И Найти(СтруктураРезультат.ТипСтрокой, "(") = 0
			И ОбщиеПеременные.СоставныеТипы.Свойство(СтруктураРезультат.ТипСтрокой, СоответствиеТиповСоставногоТипа) Тогда
			// Если тип ссылается на составной тип, заполним состав составного типа.
			// При этом признак составного типа не устанавливается намеренно.
			СтруктураРезультат.СоставнойТип = Ложь;
			Для Каждого СостТип Из СоответствиеТиповСоставногоТипа Цикл
				СтруктураРезультат.СоответствиеТипов.Вставить(СостТип.Ключ, СостТип.Значение);
			КонецЦикла;
		Иначе
			СтруктураРезультат.СоответствиеТипов.Вставить(СтруктураРезультат.ТипСтрокой, СтруктураРезультат.ТипСтрокой);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураРезультат;
КонецФункции

Функция ПолучитьДополнениеКТипу(ТипЗначенияХДТО, ИмяТипа)
	Результат = "";
	СтрокаПростыеТипы = "#string#int#dec#decimal#";
	Если Найти(СтрокаПростыеТипы, "#"+ИмяТипа+"#") = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	Если ТипЗначенияХДТО.Фасеты = Неопределено
		ИЛИ ТипЗначенияХДТО.Фасеты.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	Для каждого Фасет Из ТипЗначенияХДТО.Фасеты Цикл
		ТипФасета = СокрЛП(Фасет.Вид);
		Если Найти(ТипФасета, "разряд") > 0 ИЛИ Найти(ТипФасета, "длина") Тогда
			Результат = Результат + СокрЛП(Фасет.Значение) + ",";
		КонецЕсли;
	КонецЦикла;
	Если Результат <> "" Тогда
		Результат = " (" + Лев(Результат, СтрДлина(Результат)-1) + ")";
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция НайтиСоздатьОбъектФормата(НаименованиеОбъекта, ОбщиеПеременные, ТипОбщегоРеквизита = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Ссылка,
			|	ПометкаУдаления
			|ИЗ Справочник.ОбъектыФормата
			|ГДЕ Владелец = &Формат И Наименование = &ИмяОбъекта
			|	И (ТипОбщегоРеквизита = &ТипОбщегоРеквизита 
			|		ИЛИ &ТипОбщегоРеквизита = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.ПустаяСсылка))
			|";
	Запрос.УстановитьПараметр("Формат", ОбщиеПеременные.ВерсияФормата);
	Запрос.УстановитьПараметр("ИмяОбъекта", НаименованиеОбъекта);
	Запрос.УстановитьПараметр("ТипОбщегоРеквизита", ?(ТипОбщегоРеквизита = Неопределено, Перечисления.ТипыОбщихРеквизитов.ПустаяСсылка(), ТипОбщегоРеквизита));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекОбъектФормата = Выборка.Ссылка;
		Если Выборка.ПометкаУдаления Тогда
			СпрОбъект = ТекОбъектФормата.ПолучитьОбъект();
			СпрОбъект.ПометкаУдаления = Ложь;
			СпрОбъект.Записать();
		КонецЕсли;
		УдалитьИзОбъектовФормата(ТекОбъектФормата, ОбщиеПеременные);
	Иначе
		ОбъектФормата = Справочники.ОбъектыФормата.СоздатьЭлемент();
		ОбъектФормата.Владелец = ОбщиеПеременные.ВерсияФормата;
		ОбъектФормата.Наименование = НаименованиеОбъекта;
		ОбъектФормата.ТипОбщегоРеквизита = ТипОбщегоРеквизита;
		ОбъектФормата.Записать();
		ТекОбъектФормата = ОбъектФормата.Ссылка;
	КонецЕсли;
	Возврат ТекОбъектФормата;
КонецФункции

Процедура ПолучитьОбъектыФормата(ОбщиеПеременные)
	
	Если ОбщиеПеременные.ЗагрузитьНовыйФормат
		ИЛИ ОбщиеПеременные.ДобавлятьТолькоНовые Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Объекты.Ссылка
	                      |ИЗ
	                      |	Справочник.ОбъектыФормата КАК Объекты
	                      |ГДЕ
	                      |	Объекты.Владелец = &ВерсияФормата
	                      |	И Объекты.ЭтоГруппа = ЛОЖЬ
	                      |	И Объекты.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Свойства.Ссылка
	                      |ИЗ
	                      |	Справочник.СвойстваФормата КАК Свойства
	                      |ГДЕ
	                      |	Свойства.Владелец.Владелец = &ВерсияФормата
	                      |	И Свойства.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Значения.Ссылка
	                      |ИЗ
	                      |	Справочник.ЗначенияФормата КАК Значения
	                      |ГДЕ
	                      |	Значения.Владелец.Владелец = &ВерсияФормата
	                      |	И Значения.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Типы.Ссылка
	                      |ИЗ
	                      |	Справочник.ТипыФормата КАК Типы
	                      |ГДЕ
	                      |	Типы.Владелец = &ВерсияФормата
	                      |	И Типы.ПометкаУдаления = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("ВерсияФормата", ОбщиеПеременные.ВерсияФормата);
	
	мОбъектыФормата = Запрос.Выполнить().Выгрузить();
	
	мОбъектыФормата.Индексы.Добавить("Ссылка");
	ОбщиеПеременные.Вставить("ОбъектыФормата", мОбъектыФормата);
КонецПроцедуры 

Процедура УдалитьИзОбъектовФормата(Объект, ОбщиеПеременные)
	
	Если ОбщиеПеременные.ЗагрузитьНовыйФормат
		ИЛИ ОбщиеПеременные.ДобавлятьТолькоНовые Тогда
		
		Возврат;
		
	КонецЕсли;
	
	НайденнаяСтрока = ОбщиеПеременные.ОбъектыФормата.Найти(Объект, "Ссылка");
	
	Если НайденнаяСтрока <> Неопределено Тогда
		
		ОбщиеПеременные.ОбъектыФормата.Удалить(НайденнаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры 

Функция ТекстЗапросаСвойстваФормата()
	Возврат "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СвойстваФормата.Ссылка КАК Ссылка,
	|	ВЫРАЗИТЬ(СвойстваФормата.Тип КАК Строка(1000)) КАК Тип,
	|	СвойстваФормата.ПометкаУдаления КАК ПометкаУдаления,
	|	СвойстваФормата.ОбъектХранительСвойств КАК ОбъектХранительСвойств,
	|	СвойстваФормата.Родитель КАК Родитель,
	|	СвойстваФормата.НижняяГраница КАК НижняяГраница,
	|	СвойстваФормата.ТипОбщегоСвойства КАК ТипОбщегоСвойства,
	|	СвойстваФормата.Порядок КАК Порядок,
	|	СвойстваФормата.Обязательное КАК Обязательное,
	|	ВЫБОР КОГДА СвойстваФормата.ЭтоГруппа ТОГДА
	|		ЛОЖЬ
	|	ИНАЧЕ СвойстваФормата.СоставнойТип
	|	КОНЕЦ 							КАК СоставнойТип,
	|	Количество(СоставСвойств.ТипФормата) КАК КоличествоСтрок
	|ИЗ Справочник.СвойстваФормата КАК СвойстваФормата
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СвойстваФормата.Состав КАК СоставСвойств
	|ПО СоставСвойств.Ссылка = СвойстваФормата.Ссылка
	|ГДЕ СвойстваФормата.Владелец = &ОбъектФормата И СвойстваФормата.Наименование = &ИмяСвойства
	|	И СвойстваФормата.ЭтоГруппа = &ЭтоГруппа 
	|	И СвойстваФормата.Родитель = &Родитель
	|СГРУППИРОВАТЬ ПО СвойстваФормата.Ссылка";
КонецФункции

Функция ТекстЗапросаЗначенияФормата()
	Возврат "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка КАК Ссылка,
	|	Порядок КАК Порядок
	|ИЗ Справочник.ЗначенияФормата
	|ГДЕ Владелец = &ОбъектФормата И Наименование = &ИмяЗначения";
КонецФункции

#КонецОбласти
#КонецЕсли
